emacs/.emacs.d/Demo.org
#+Title: Emacs Demo!
#+Author: Maxim Rurenko
#+OPTIONS: toc:nil reveal_mathjax:t
#+REVEAL_THEME: night
#+REVEAL_TRANS: linear
#+REVEAL_ROOT: http://cdn.jsdelivr.net/reveal.js/3.0.0/

* Straight
Package manager
Link: https://github.com/raxod502/straight.el
Pros:
- Repetablility. Lock files
- Fast to start
- Easy but not fast packages updating
- Good documentation
* General
Bind mappings like evil-leader
* Telephone-line
** Rich-minority
* Org-mode
Settings file: './lisp/init-org.el'

** Outlines
*** Sub-level 1
*** Sub-level 2
**** Sub-sub level
***** Sub-sub-sub level
** TODOs
*** TODO This is a TODO outline
It has 2 different states:
- TODO
- DONE

But you could extend this list with yours.
*** DONE This is a DONE todo outline
*** You could switch state with <C-c C-t>
I have a special settings to capture a resolution message and timestamp
*** TODO [1/2] With progress of internal todos
**** TODO Need to do
**** DONE Done task
* Evil
** Marks
Remeber some place and return to it
Normal mode -> m + <key to remember>
**
** Evil plugins
*** evil-surround
*** evil-visualstar
*** evil-mc
*** evil-matchit
*** vimish-fold
*** evil-nerd-commenter
*** evil-anzu
*** evil-goggles
* Neotree
* Hydra
* Drag-stuff
* Jump-tree
Move around on touched places.

* Highlight-symbol
Use this to highlight variables. You can highlight several variables in the same time.
* Swiper
** Counsel
** Ivy
* Projectile
* Yasnippet
* Flyspell
* Git
** Magit
** Git-timemachine
** Git-gutter
* Ace-window
* Dumb-jump
* Beacon
* Avy
* Flycheck
* Emmet
* Company
* Web (mode)
* Javascript
** Tide
** js2-mode
** rjsx-mode
* Python
** Pyenv-mode
** elpy
** sphinx-doc
** py-yapf
* Elm
** elm-mode
* Elixir
** Alchemist
* Jump-tree
* Smex
