docs/Demo.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Emacs Demo!</title>
<meta name="author" content="(Maxim Rurenko)"/>
<link rel="stylesheet" href="http://cdn.jsdelivr.net/reveal.js/3.0.0/css/reveal.css"/>

<link rel="stylesheet" href="http://cdn.jsdelivr.net/reveal.js/3.0.0/css/theme/night.css" id="theme"/>


<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide"><h1 class="title">Emacs Demo!</h1><h2 class="author">Maxim Rurenko</h2><p class="date">Created: 2018-07-15 Sun 19:14</p>
</section>

<section>
<section id="slide-1">
<h2 id="org5e6bd2b"><span class="section-number-2">1</span> Straight</h2>
<p>
Package manager
Link: <a href="https://github.com/raxod502/straight.el">https://github.com/raxod502/straight.el</a>
Pros:
</p>
<ul>
<li>Repetablility. Lock files</li>
<li>Fast to start</li>
<li>Easy but not fast packages updating</li>
<li>Good documentation</li>

</ul>
</section>
</section>
<section>
<section id="slide-2">
<h2 id="org59fd37e"><span class="section-number-2">2</span> General</h2>
<p>
Bind mappings like evil-leader
</p>
</section>
</section>
<section>
<section id="slide-3">
<h2 id="org01a6e91"><span class="section-number-2">3</span> Telephone-line</h2>
<div class="outline-text-2" id="text-3">
</div>
</section>
<section id="slide-3-1">
<h3 id="org73af8cf"><span class="section-number-3">3.1</span> Rich-minority</h3>
</section>
</section>
<section>
<section id="slide-4">
<h2 id="org39dd1e7"><span class="section-number-2">4</span> Org-mode</h2>
<p>
Settings file: './lisp/init-org.el'
</p>

</section>
<section id="slide-4-1">
<h3 id="org0c28ad3"><span class="section-number-3">4.1</span> Outlines</h3>
<div class="outline-text-3" id="text-4-1">
</div>
</section>
<section id="slide-4-1-1">
<h4 id="org6cff425"><span class="section-number-4">4.1.1</span> Sub-level 1</h4>
</section>
<section id="slide-4-1-2">
<h4 id="orgc9d523e"><span class="section-number-4">4.1.2</span> Sub-level 2</h4>
<div class="outline-text-4" id="text-4-1-2">
</div>
<ol class="org-ol">
<li><a id="org818c3fa"></a>Sub-sub level<br />
<ol class="org-ol">
<li><a id="orga2a9be7"></a>Sub-sub-sub level<br /></li>
</ol>
</li>
</ol>
</section>
<section id="slide-4-2">
<h3 id="org72d2b36"><span class="section-number-3">4.2</span> TODOs</h3>
<div class="outline-text-3" id="text-4-2">
</div>
</section>
<section id="slide-4-2-1">
<h4 id="org69ba96f"><span class="section-number-4">4.2.1</span> <span class="todo TODO">TODO</span> This is a TODO outline</h4>
<p>
It has 2 different states:
</p>
<ul>
<li>TODO</li>
<li>DONE</li>

</ul>

<p>
But you could extend this list with yours.
</p>
</section>
<section id="slide-4-2-2">
<h4 id="orgfd0f13c"><span class="section-number-4">4.2.2</span> <span class="done DONE">DONE</span> This is a DONE todo outline</h4>
</section>
<section id="slide-4-2-3">
<h4 id="orgd087c8d"><span class="section-number-4">4.2.3</span> You could switch state with &lt;C-c C-t&gt;</h4>
<p>
I have a special settings to capture a resolution message and timestamp
</p>
</section>
<section id="slide-4-2-4">
<h4 id="orgd0be318"><span class="section-number-4">4.2.4</span> <span class="todo TODO">TODO</span> <code>[1/2]</code> With progress of internal todos</h4>
<div class="outline-text-4" id="text-4-2-4">
</div>
<ol class="org-ol">
<li><a id="org5afce06"></a><span class="todo TODO">TODO</span> Need to do<br /></li>
<li><a id="org1adc7a0"></a><span class="done DONE">DONE</span> Done task<br /></li>
</ol>
</section>
</section>
<section>
<section id="slide-5">
<h2 id="orgaca4186"><span class="section-number-2">5</span> Evil</h2>
<div class="outline-text-2" id="text-5">
</div>
</section>
<section id="slide-5-1">
<h3 id="orgc7c7c7a"><span class="section-number-3">5.1</span> Marks</h3>
<p>
Remeber some place and return to it
Normal mode -&gt; m + &lt;key to remember&gt;
**
</p>
</section>
<section id="slide-5-2">
<h3 id="orga545252"><span class="section-number-3">5.2</span> Evil plugins</h3>
<div class="outline-text-3" id="text-5-2">
</div>
</section>
<section id="slide-5-2-1">
<h4 id="orga58e293"><span class="section-number-4">5.2.1</span> evil-surround</h4>
</section>
<section id="slide-5-2-2">
<h4 id="org39f221d"><span class="section-number-4">5.2.2</span> evil-visualstar</h4>
</section>
<section id="slide-5-2-3">
<h4 id="org16e960c"><span class="section-number-4">5.2.3</span> evil-mc</h4>
</section>
<section id="slide-5-2-4">
<h4 id="org35e2277"><span class="section-number-4">5.2.4</span> evil-matchit</h4>
</section>
<section id="slide-5-2-5">
<h4 id="org977b2b8"><span class="section-number-4">5.2.5</span> vimish-fold</h4>
</section>
<section id="slide-5-2-6">
<h4 id="org10836ae"><span class="section-number-4">5.2.6</span> evil-nerd-commenter</h4>
</section>
<section id="slide-5-2-7">
<h4 id="orgcbd94a6"><span class="section-number-4">5.2.7</span> evil-anzu</h4>
</section>
<section id="slide-5-2-8">
<h4 id="org4315bf0"><span class="section-number-4">5.2.8</span> evil-goggles</h4>
</section>
</section>
<section>
<section id="slide-6">
<h2 id="org14119b0"><span class="section-number-2">6</span> Neotree</h2>
</section>
</section>
<section>
<section id="slide-7">
<h2 id="orgc81f63d"><span class="section-number-2">7</span> Hydra</h2>
</section>
</section>
<section>
<section id="slide-8">
<h2 id="org2484789"><span class="section-number-2">8</span> Drag-stuff</h2>
</section>
</section>
<section>
<section id="slide-9">
<h2 id="org7fa308b"><span class="section-number-2">9</span> Jump-tree</h2>
<p>
Move around on touched places.
</p>

</section>
</section>
<section>
<section id="slide-10">
<h2 id="org53c1ab5"><span class="section-number-2">10</span> Highlight-symbol</h2>
<p>
Use this to highlight variables. You can highlight several variables in the same time.
</p>
</section>
</section>
<section>
<section id="slide-11">
<h2 id="org4f600b1"><span class="section-number-2">11</span> Swiper</h2>
<div class="outline-text-2" id="text-11">
</div>
</section>
<section id="slide-11-1">
<h3 id="org8ffbd17"><span class="section-number-3">11.1</span> Counsel</h3>
</section>
<section id="slide-11-2">
<h3 id="org658a58f"><span class="section-number-3">11.2</span> Ivy</h3>
</section>
</section>
<section>
<section id="slide-12">
<h2 id="org3955fa2"><span class="section-number-2">12</span> Projectile</h2>
</section>
</section>
<section>
<section id="slide-13">
<h2 id="orgce7d418"><span class="section-number-2">13</span> Yasnippet</h2>
</section>
</section>
<section>
<section id="slide-14">
<h2 id="orgba11a97"><span class="section-number-2">14</span> Flyspell</h2>
</section>
</section>
<section>
<section id="slide-15">
<h2 id="org4fb8db1"><span class="section-number-2">15</span> Git</h2>
<div class="outline-text-2" id="text-15">
</div>
</section>
<section id="slide-15-1">
<h3 id="org1b6506b"><span class="section-number-3">15.1</span> Magit</h3>
</section>
<section id="slide-15-2">
<h3 id="org46c5fcb"><span class="section-number-3">15.2</span> Git-timemachine</h3>
</section>
<section id="slide-15-3">
<h3 id="org1ab8279"><span class="section-number-3">15.3</span> Git-gutter</h3>
</section>
</section>
<section>
<section id="slide-16">
<h2 id="orge612d73"><span class="section-number-2">16</span> Ace-window</h2>
</section>
</section>
<section>
<section id="slide-17">
<h2 id="orgdedc025"><span class="section-number-2">17</span> Dumb-jump</h2>
</section>
</section>
<section>
<section id="slide-18">
<h2 id="orgf212907"><span class="section-number-2">18</span> Beacon</h2>
</section>
</section>
<section>
<section id="slide-19">
<h2 id="org607edb3"><span class="section-number-2">19</span> Avy</h2>
</section>
</section>
<section>
<section id="slide-20">
<h2 id="org4fe3c3f"><span class="section-number-2">20</span> Flycheck</h2>
</section>
</section>
<section>
<section id="slide-21">
<h2 id="orgc6aebe8"><span class="section-number-2">21</span> Emmet</h2>
</section>
</section>
<section>
<section id="slide-22">
<h2 id="org6662aeb"><span class="section-number-2">22</span> Company</h2>
</section>
</section>
<section>
<section id="slide-23">
<h2 id="orgc60580c"><span class="section-number-2">23</span> Web (mode)</h2>
</section>
</section>
<section>
<section id="slide-24">
<h2 id="org0b7e86a"><span class="section-number-2">24</span> Javascript</h2>
<div class="outline-text-2" id="text-24">
</div>
</section>
<section id="slide-24-1">
<h3 id="orgabe76e0"><span class="section-number-3">24.1</span> Tide</h3>
</section>
<section id="slide-24-2">
<h3 id="orgc9c05d6"><span class="section-number-3">24.2</span> js2-mode</h3>
</section>
<section id="slide-24-3">
<h3 id="orgc0cd0d8"><span class="section-number-3">24.3</span> rjsx-mode</h3>
</section>
</section>
<section>
<section id="slide-25">
<h2 id="org1187ed8"><span class="section-number-2">25</span> Python</h2>
<div class="outline-text-2" id="text-25">
</div>
</section>
<section id="slide-25-1">
<h3 id="org5a8ba49"><span class="section-number-3">25.1</span> Pyenv-mode</h3>
</section>
<section id="slide-25-2">
<h3 id="org90889ac"><span class="section-number-3">25.2</span> elpy</h3>
</section>
<section id="slide-25-3">
<h3 id="org1572f79"><span class="section-number-3">25.3</span> sphinx-doc</h3>
</section>
<section id="slide-25-4">
<h3 id="org13b5437"><span class="section-number-3">25.4</span> py-yapf</h3>
</section>
</section>
<section>
<section id="slide-26">
<h2 id="orge58bb08"><span class="section-number-2">26</span> Elm</h2>
<div class="outline-text-2" id="text-26">
</div>
</section>
<section id="slide-26-1">
<h3 id="org8366a41"><span class="section-number-3">26.1</span> elm-mode</h3>
</section>
</section>
<section>
<section id="slide-27">
<h2 id="org1536b8c"><span class="section-number-2">27</span> Elixir</h2>
<div class="outline-text-2" id="text-27">
</div>
</section>
<section id="slide-27-1">
<h3 id="orge90705a"><span class="section-number-3">27.1</span> Alchemist</h3>
</section>
</section>
<section>
<section id="slide-28">
<h2 id="org768780a"><span class="section-number-2">28</span> Jump-tree</h2>
</section>
</section>
<section>
<section id="slide-29">
<h2 id="orgeebf9b3"><span class="section-number-2">29</span> Smex</h2>
</section>
</section>
</div>
</div>
<script src="http://cdn.jsdelivr.net/reveal.js/3.0.0/lib/js/head.min.js"></script>
<script src="http://cdn.jsdelivr.net/reveal.js/3.0.0/js/reveal.js"></script>

<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({

controls: true,
progress: true,
history: false,
center: true,
slideNumber: 'c',
rollingLinks: false,
keyboard: true,
overview: true,

theme: Reveal.getQueryHash().theme, // available themes are in /css/theme
transition: Reveal.getQueryHash().transition || 'linear', // default/cube/page/concave/zoom/linear/fade/none
transitionSpeed: 'default',
multiplex: {
    secret: '', // null if client
    id: '', // id, obtained from socket.io server
    url: '' // Location of socket.io server
},

// Optional libraries used to extend on reveal.js
dependencies: [
 { src: 'http://cdn.jsdelivr.net/reveal.js/3.0.0/lib/js/classList.js', condition: function() { return !document.body.classList; } },
 { src: 'http://cdn.jsdelivr.net/reveal.js/3.0.0/plugin/markdown/marked.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: 'http://cdn.jsdelivr.net/reveal.js/3.0.0/plugin/markdown/markdown.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: 'http://cdn.jsdelivr.net/reveal.js/3.0.0/plugin/zoom-js/zoom.js', async: true, condition: function() { return !!document.body.classList; } },
 { src: 'http://cdn.jsdelivr.net/reveal.js/3.0.0/plugin/notes/notes.js', async: true, condition: function() { return !!document.body.classList; } }]
});
</script>
</body>
</html>
